k6-test-main/zeta/kyverno-load-testing/k6/tmp/temp/kyverno-pods-zeta.js-3vu-3it-logs.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /script/script.js
     output: -

  scenarios: (100.00%) 1 scenario, 3 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 3 looping VUs for 1m0s (gracefulStop: 30s)

time="2023-12-25T15:12:43Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:43Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:43Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m01.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [   2% ] 3 VUs  0m01.0s/1m0s
time="2023-12-25T15:12:44Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:44Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:44Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m02.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [   3% ] 3 VUs  0m02.0s/1m0s
time="2023-12-25T15:12:45Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:45Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:45Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:12:46Z" level=info msg="received response 201 201 Created" source=console

running (0m03.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [   5% ] 3 VUs  0m03.0s/1m0s
time="2023-12-25T15:12:46Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:46Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:46Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:12:47Z" level=info msg="received response 201 201 Created" source=console

running (0m04.0s), 3/3 VUs, 26 complete and 0 interrupted iterations
default   [   7% ] 3 VUs  0m04.0s/1m0s
time="2023-12-25T15:12:47Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:47Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:47Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m05.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [   8% ] 3 VUs  0m05.0s/1m0s
time="2023-12-25T15:12:48Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:48Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:48Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m06.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  10% ] 3 VUs  0m06.0s/1m0s
time="2023-12-25T15:12:49Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:49Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:49Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:50Z" level=info msg="received response 201 201 Created" source=console

running (0m07.0s), 3/3 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 3 VUs  0m07.0s/1m0s
time="2023-12-25T15:12:50Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:50Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:50Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m08.0s), 3/3 VUs, 44 complete and 0 interrupted iterations
default   [  13% ] 3 VUs  0m08.0s/1m0s
time="2023-12-25T15:12:51Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:51Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:51Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:12:52Z" level=info msg="received response 201 201 Created" source=console

running (0m09.0s), 3/3 VUs, 50 complete and 0 interrupted iterations
default   [  15% ] 3 VUs  0m09.0s/1m0s
time="2023-12-25T15:12:52Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:52Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:52Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m10.0s), 3/3 VUs, 56 complete and 0 interrupted iterations
default   [  17% ] 3 VUs  0m10.0s/1m0s
time="2023-12-25T15:12:53Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:53Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:53Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:12:54Z" level=info msg="received response 201 201 Created" source=console

running (0m11.0s), 3/3 VUs, 62 complete and 0 interrupted iterations
default   [  18% ] 3 VUs  0m11.0s/1m0s
time="2023-12-25T15:12:54Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:54Z" level=info msg="received response 201 201 Created" source=console

running (0m12.0s), 3/3 VUs, 64 complete and 0 interrupted iterations
default   [  20% ] 3 VUs  0m12.0s/1m0s
time="2023-12-25T15:12:55Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:55Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:55Z" level=info msg="received response 201 201 Created" source=console

running (0m13.0s), 3/3 VUs, 67 complete and 0 interrupted iterations
default   [  22% ] 3 VUs  0m13.0s/1m0s
time="2023-12-25T15:12:56Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:56Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:56Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:12:57Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:57Z" level=info msg="received response 201 201 Created" source=console

running (0m14.0s), 3/3 VUs, 73 complete and 0 interrupted iterations
default   [  23% ] 3 VUs  0m14.0s/1m0s
time="2023-12-25T15:12:57Z" level=info msg="received response 201 201 Created" source=console

running (0m15.0s), 3/3 VUs, 74 complete and 0 interrupted iterations
default   [  25% ] 3 VUs  0m15.0s/1m0s
time="2023-12-25T15:12:58Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:58Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:58Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m16.0s), 3/3 VUs, 79 complete and 0 interrupted iterations
default   [  27% ] 3 VUs  0m16.0s/1m0s
time="2023-12-25T15:12:59Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:12:59Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:00Z" level=info msg="received response 201 201 Created" source=console

running (0m17.0s), 3/3 VUs, 82 complete and 0 interrupted iterations
default   [  28% ] 3 VUs  0m17.0s/1m0s
time="2023-12-25T15:13:00Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:00Z" level=info msg="received response 201 201 Created" source=console

running (0m18.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  30% ] 3 VUs  0m18.0s/1m0s
time="2023-12-25T15:13:01Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:01Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:01Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m19.0s), 3/3 VUs, 88 complete and 0 interrupted iterations
default   [  32% ] 3 VUs  0m19.0s/1m0s
time="2023-12-25T15:13:02Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:02Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:02Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m20.0s), 3/3 VUs, 93 complete and 0 interrupted iterations
default   [  33% ] 3 VUs  0m20.0s/1m0s
time="2023-12-25T15:13:03Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:03Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:03Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:04Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:04Z" level=info msg="received response 201 201 Created" source=console

running (0m21.0s), 3/3 VUs, 98 complete and 0 interrupted iterations
default   [  35% ] 3 VUs  0m21.0s/1m0s
time="2023-12-25T15:13:04Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:04Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:04Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m22.0s), 3/3 VUs, 102 complete and 0 interrupted iterations
default   [  37% ] 3 VUs  0m22.0s/1m0s
time="2023-12-25T15:13:05Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:05Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:05Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:06Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:06Z" level=info msg="received response 201 201 Created" source=console

running (0m23.0s), 3/3 VUs, 107 complete and 0 interrupted iterations
default   [  38% ] 3 VUs  0m23.0s/1m0s
time="2023-12-25T15:13:06Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:06Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:06Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m24.0s), 3/3 VUs, 112 complete and 0 interrupted iterations
default   [  40% ] 3 VUs  0m24.0s/1m0s
time="2023-12-25T15:13:07Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:07Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:07Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:08Z" level=info msg="received response 201 201 Created" source=console

running (0m25.0s), 3/3 VUs, 117 complete and 0 interrupted iterations
default   [  42% ] 3 VUs  0m25.0s/1m0s
time="2023-12-25T15:13:08Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:08Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:08Z" level=info msg="received response 201 201 Created" source=console

running (0m26.0s), 3/3 VUs, 120 complete and 0 interrupted iterations
default   [  43% ] 3 VUs  0m26.0s/1m0s
time="2023-12-25T15:13:09Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:09Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:09Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:10Z" level=info msg="received response 201 201 Created" source=console

running (0m27.0s), 3/3 VUs, 124 complete and 0 interrupted iterations
default   [  45% ] 3 VUs  0m27.0s/1m0s
time="2023-12-25T15:13:10Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:10Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:10Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m28.0s), 3/3 VUs, 128 complete and 0 interrupted iterations
default   [  47% ] 3 VUs  0m28.0s/1m0s
time="2023-12-25T15:13:11Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:11Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:11Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m29.0s), 3/3 VUs, 133 complete and 0 interrupted iterations
default   [  48% ] 3 VUs  0m29.0s/1m0s
time="2023-12-25T15:13:12Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:12Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:12Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m30.0s), 3/3 VUs, 137 complete and 0 interrupted iterations
default   [  50% ] 3 VUs  0m30.0s/1m0s
time="2023-12-25T15:13:13Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:13Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:13Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m31.0s), 3/3 VUs, 142 complete and 0 interrupted iterations
default   [  52% ] 3 VUs  0m31.0s/1m0s
time="2023-12-25T15:13:14Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:14Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:14Z" level=info msg="received response 201 201 Created" source=console

running (0m32.0s), 3/3 VUs, 145 complete and 0 interrupted iterations
default   [  53% ] 3 VUs  0m32.0s/1m0s
time="2023-12-25T15:13:15Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:15Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:15Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m33.0s), 3/3 VUs, 149 complete and 0 interrupted iterations
default   [  55% ] 3 VUs  0m33.0s/1m0s
time="2023-12-25T15:13:16Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:16Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:16Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:17Z" level=info msg="received response 201 201 Created" source=console

running (0m34.0s), 3/3 VUs, 155 complete and 0 interrupted iterations
default   [  57% ] 3 VUs  0m34.0s/1m0s
time="2023-12-25T15:13:17Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:17Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:17Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:18Z" level=info msg="received response 201 201 Created" source=console

running (0m35.0s), 3/3 VUs, 161 complete and 0 interrupted iterations
default   [  58% ] 3 VUs  0m35.0s/1m0s
time="2023-12-25T15:13:18Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:18Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:18Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m36.0s), 3/3 VUs, 166 complete and 0 interrupted iterations
default   [  60% ] 3 VUs  0m36.0s/1m0s
time="2023-12-25T15:13:19Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:19Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:19Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:20Z" level=info msg="received response 201 201 Created" source=console

running (0m37.0s), 3/3 VUs, 171 complete and 0 interrupted iterations
default   [  62% ] 3 VUs  0m37.0s/1m0s
time="2023-12-25T15:13:20Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:20Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:21Z" level=info msg="received response 201 201 Created" source=console

running (0m38.0s), 3/3 VUs, 174 complete and 0 interrupted iterations
default   [  63% ] 3 VUs  0m38.0s/1m0s
time="2023-12-25T15:13:21Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:21Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:21Z" level=info msg="received response 201 201 Created" source=console

running (0m39.0s), 3/3 VUs, 177 complete and 0 interrupted iterations
default   [  65% ] 3 VUs  0m39.0s/1m0s
time="2023-12-25T15:13:22Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:22Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:22Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m40.0s), 3/3 VUs, 181 complete and 0 interrupted iterations
default   [  67% ] 3 VUs  0m40.0s/1m0s
time="2023-12-25T15:13:23Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:23Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:23Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:24Z" level=info msg="received response 201 201 Created" source=console

running (0m41.0s), 3/3 VUs, 185 complete and 0 interrupted iterations
default   [  68% ] 3 VUs  0m41.0s/1m0s
time="2023-12-25T15:13:24Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:24Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:25Z" level=info msg="received response 201 201 Created" source=console

running (0m42.0s), 3/3 VUs, 188 complete and 0 interrupted iterations
default   [  70% ] 3 VUs  0m42.0s/1m0s
time="2023-12-25T15:13:25Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:25Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:25Z" level=info msg="received response 201 201 Created" source=console

running (0m43.0s), 3/3 VUs, 191 complete and 0 interrupted iterations
default   [  72% ] 3 VUs  0m43.0s/1m0s
time="2023-12-25T15:13:26Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:26Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:26Z" level=info msg="received response 201 201 Created" source=console

running (0m44.0s), 3/3 VUs, 194 complete and 0 interrupted iterations
default   [  73% ] 3 VUs  0m44.0s/1m0s
time="2023-12-25T15:13:27Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:27Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:27Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m45.0s), 3/3 VUs, 198 complete and 0 interrupted iterations
default   [  75% ] 3 VUs  0m45.0s/1m0s
time="2023-12-25T15:13:28Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:28Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:28Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:29Z" level=info msg="received response 201 201 Created" source=console

running (0m46.0s), 3/3 VUs, 204 complete and 0 interrupted iterations
default   [  77% ] 3 VUs  0m46.0s/1m0s
time="2023-12-25T15:13:29Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:29Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:29Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:30Z" level=info msg="received response 201 201 Created" source=console

running (0m47.0s), 3/3 VUs, 209 complete and 0 interrupted iterations
default   [  78% ] 3 VUs  0m47.0s/1m0s
time="2023-12-25T15:13:30Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:30Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:30Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:31Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:31Z" level=info msg="received response 201 201 Created" source=console

running (0m48.0s), 3/3 VUs, 215 complete and 0 interrupted iterations
default   [  80% ] 3 VUs  0m48.0s/1m0s
time="2023-12-25T15:13:31Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:31Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:31Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:32Z" level=info msg="received response 201 201 Created" source=console

running (0m49.0s), 3/3 VUs, 219 complete and 0 interrupted iterations
default   [  82% ] 3 VUs  0m49.0s/1m0s
time="2023-12-25T15:13:32Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:32Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:32Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m50.0s), 3/3 VUs, 223 complete and 0 interrupted iterations
default   [  83% ] 3 VUs  0m50.0s/1m0s
time="2023-12-25T15:13:33Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:33Z" level=info msg="received response 201 201 Created" source=console

running (0m51.0s), 3/3 VUs, 225 complete and 0 interrupted iterations
default   [  85% ] 3 VUs  0m51.0s/1m0s
time="2023-12-25T15:13:34Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:34Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:34Z" level=info msg="received response 201 201 Created" source=console

running (0m52.0s), 3/3 VUs, 228 complete and 0 interrupted iterations
default   [  87% ] 3 VUs  0m52.0s/1m0s
time="2023-12-25T15:13:35Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:35Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:35Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m53.0s), 3/3 VUs, 232 complete and 0 interrupted iterations
default   [  88% ] 3 VUs  0m53.0s/1m0s
time="2023-12-25T15:13:36Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:36Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:36Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:37Z" level=info msg="received response 201 201 Created" source=console

running (0m54.0s), 3/3 VUs, 239 complete and 0 interrupted iterations
default   [  90% ] 3 VUs  0m54.0s/1m0s
time="2023-12-25T15:13:37Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:37Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:37Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:38Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:38Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:38Z" level=info msg="received response 201 201 Created" source=console

running (0m55.0s), 3/3 VUs, 246 complete and 0 interrupted iterations
default   [  92% ] 3 VUs  0m55.0s/1m0s
time="2023-12-25T15:13:38Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:38Z" level=info msg="received response 201 201 Created" source=console

running (0m56.0s), 3/3 VUs, 248 complete and 0 interrupted iterations
default   [  93% ] 3 VUs  0m56.0s/1m0s
time="2023-12-25T15:13:39Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:39Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:39Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:40Z" level=info msg="received response 201 201 Created" source=console

running (0m57.0s), 3/3 VUs, 252 complete and 0 interrupted iterations
default   [  95% ] 3 VUs  0m57.0s/1m0s
time="2023-12-25T15:13:40Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:40Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:40Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-25T15:13:41Z" level=info msg="received response 201 201 Created" source=console

running (0m58.0s), 3/3 VUs, 257 complete and 0 interrupted iterations
default   [  97% ] 3 VUs  0m58.0s/1m0s
time="2023-12-25T15:13:41Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:41Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:41Z" level=info msg="received response 201 201 Created" source=console
[...]

running (0m59.0s), 3/3 VUs, 261 complete and 0 interrupted iterations
default   [  98% ] 3 VUs  0m59.0s/1m0s
time="2023-12-25T15:13:42Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:42Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:42Z" level=info msg="received response 201 201 Created" source=console
[...]

running (1m00.0s), 3/3 VUs, 265 complete and 0 interrupted iterations
default   [ 100% ] 3 VUs  1m00.0s/1m0s
time="2023-12-25T15:13:43Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:43Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-25T15:13:43Z" level=info msg="received response 201 201 Created" source=console

     ✓ verify response code of POST is 201

     █ teardown

     checks.........................: 100.00% ✓ 268      ✗ 0  
     data_received..................: 615 kB  10 kB/s
     data_sent......................: 92 kB   1.5 kB/s
     http_req_blocked...............: avg=120.77µs min=248ns   med=463ns    max=10.92ms  p(90)=731ns    p(95)=840ns   
     http_req_connecting............: avg=2.03µs   min=0s      med=0s       max=225.67µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=673.95ms min=13.45ms med=623.47ms max=1.68s    p(90)=1.1s     p(95)=1.18s   
       { expected_response:true }...: avg=673.95ms min=13.45ms med=623.47ms max=1.68s    p(90)=1.1s     p(95)=1.18s   
     http_req_failed................: 0.00%   ✓ 0        ✗ 268
     http_req_receiving.............: avg=99.59µs  min=31.23µs med=93.5µs   max=1.33ms   p(90)=130.93µs p(95)=142.19µs
     http_req_sending...............: avg=79.73µs  min=51.55µs med=78.31µs  max=141.15µs p(90)=97.91µs  p(95)=108.28µs
     http_req_tls_handshaking.......: avg=83.73µs  min=0s      med=0s       max=7.67ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=673.77ms min=13.3ms  med=623.24ms max=1.68s    p(90)=1.1s     p(95)=1.18s   
     http_reqs......................: 268     4.440837/s
     iteration_duration.............: avg=671.89ms min=2.65µs  med=623.25ms max=1.68s    p(90)=1.1s     p(95)=1.18s   
     iterations.....................: 268     4.440837/s
     vus............................: 3       min=3      max=3
     vus_max........................: 3       min=3      max=3


running (1m00.3s), 0/3 VUs, 268 complete and 0 interrupted iterations
default ✓ [ 100% ] 3 VUs  1m0s
============== STRIP ==============
{
    "metrics": {
        "http_req_receiving": {
            "min": 0.031238,
            "med": 0.093502,
            "max": 1.338936,
            "p(90)": 0.1309313,
            "p(95)": 0.14219769999999995,
            "avg": 0.09959251492537309
        },
        "data_sent": {
            "count": 91857,
            "rate": 1522.0969047368128
        },
        "data_received": {
            "count": 615151,
            "rate": 10193.228965084372
        },
        "iterations": {
            "count": 268,
            "rate": 4.440837067065829
        },
        "vus_max": {
            "value": 3,
            "min": 3,
            "max": 3
        },
        "http_req_connecting": {
            "p(95)": 0,
            "avg": 0.0020391865671641795,
            "min": 0,
            "med": 0,
            "max": 0.22567,
            "p(90)": 0
        },
        "http_req_sending": {
            "min": 0.051551,
            "med": 0.0783185,
            "max": 0.141151,
            "p(90)": 0.097919,
            "p(95)": 0.10828339999999999,
            "avg": 0.07973688432835821
        },
        "http_req_duration": {
            "max": 1687.879811,
            "p(90)": 1100.9265681,
            "p(95)": 1189.9309587999999,
            "avg": 673.955785391791,
            "min": 13.458061,
            "med": 623.4742940000001
        },
        "http_req_waiting": {
            "p(95)": 1189.74957245,
            "avg": 673.7764559925367,
            "min": 13.30794,
            "med": 623.2402945,
            "max": 1687.63815,
            "p(90)": 1100.7062081000001
        },
        "http_req_failed": {
            "passes": 0,
            "fails": 268,
            "value": 0
        },
        "iteration_duration": {
            "avg": 671.8928161449816,
            "min": 0.002657,
            "med": 623.258669,
            "max": 1688.139586,
            "p(90)": 1100.7416474000001,
            "p(95)": 1189.9997268
        },
        "http_req_duration{expected_response:true}": {
            "max": 1687.879811,
            "p(90)": 1100.9265681,
            "p(95)": 1189.9309587999999,
            "avg": 673.955785391791,
            "min": 13.458061,
            "med": 623.4742940000001
        },
        "http_req_tls_handshaking": {
            "max": 7.675084,
            "p(90)": 0,
            "p(95)": 0,
            "avg": 0.08373027238805969,
            "min": 0,
            "med": 0
        },
        "checks": {
            "passes": 268,
            "fails": 0,
            "value": 1
        },
        "http_reqs": {
            "rate": 4.440837067065829,
            "count": 268
        },
        "http_req_blocked": {
            "min": 0.000248,
            "med": 0.0004635,
            "max": 10.920762,
            "p(90)": 0.0007313,
            "p(95)": 0.0008408999999999994,
            "avg": 0.12077680970149242
        },
        "vus": {
            "value": 3,
            "min": 3,
            "max": 3
        }
    },
    "root_group": {
        "name": "",
        "path": "",
        "id": "d41d8cd98f00b204e9800998ecf8427e",
        "groups": {
            "teardown": {
                "path": "::teardown",
                "id": "a8a9942382e8ffe2e56ef29e664b8229",
                "groups": {},
                "checks": {},
                "name": "teardown"
            }
        },
        "checks": {
            "verify response code of POST is 201": {
                "name": "verify response code of POST is 201",
                "path": "::verify response code of POST is 201",
                "id": "8c3ca26510f8061c444b510eb133612e",
                "passes": 268,
                "fails": 0
            }
        }
    }
}